In [1]:
import pandas as pd
import numpy as np
#https://github.com/plaban1981/DATA-SCIENCE-ACADGILD-DataCleaning/blob/master/DATA%20Cleaning%20Assignment.ipynb

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
'Budapest_PaRis', 'Brussels_londOn'], 
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085], 
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]], 
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
'12. Air France', '"Swiss Air"']})

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

1. Some values in the the FlightNumber column are missing. These numbers are meant
to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in
these missing numbers and make the column an integer column (instead of a float
column).

In [4]:
df['FlightNumber'].count()

3

In [5]:
for i in range(df.FlightNumber.count() + 1):
    
    print(df.FlightNumber.loc[i,])
    
    if pd.isnull(df.FlightNumber.loc[i,]):
        
        df.loc[i, 'FlightNumber'] = df.loc[i-1, 'FlightNumber'] + 10
        
        print(df.FlightNumber.loc[i,])

10045.0
nan
10055.0
10065.0
nan
10075.0

In [6]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

2. The From_To column would be better as two separate columns! Split each string on
the underscore delimiter _ to give a new temporary DataFrame with the correct values.
Assign the correct column names to this temporary DataFrame.

In [7]:
df_tmp = df.copy()
df[['From', 'To']] = df_tmp.From_To.str.split('_', expand=True)

In [8]:
df_tmp

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [9]:
df

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,10055.0,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,10075.0,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",Brussels,londOn

3. Notice how the capitalisation of the city names is all mixed up in this temporary
DataFrame. Standardise the strings so that only the first letter is uppercase (e.g.
"londON" should become "London".)

In [10]:
df[['From']] = df.From.str.capitalize()
df[['To']] = df.To.str.capitalize()

In [11]:
df

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),London,Paris
1,MAdrid_miLAN,10055.0,[],<Air France> (12),Madrid,Milan
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),London,Stockholm
3,Budapest_PaRis,10075.0,[13],12. Air France,Budapest,Paris
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",Brussels,London

4. Delete the From_To column from df and attach the temporary DataFrame from the
previous questions.

In [12]:
print(df)
df.drop('From_To', axis=1, inplace=True)

            From_To  FlightNumber  RecentDelays              Airline  \
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

In [13]:
df['From_To'] = df_tmp['From_To']
df

,FlightNumber,RecentDelays,Airline,From,To,From_To
0,10045.0,"[23, 47]",KLM(!),London,Paris,LoNDon_paris
1,10055.0,[],<Air France> (12),Madrid,Milan,MAdrid_miLAN
2,10065.0,"[24, 43, 87]",(British Airways. ),London,Stockholm,londON_StockhOlm
3,10075.0,[13],12. Air France,Budapest,Paris,Budapest_PaRis
4,10085.0,"[67, 32]","""Swiss Air""",Brussels,London,Brussels_londOn

5a. In the RecentDelays column, the values have been entered into the DataFrame as a
list. We would like each first value in its own column, each second value in its own
column, and so on. If there isn't an Nth value, the value should be NaN.

In [14]:
rows = []
_ = df.apply(lambda row: [rows.append([row['Airline'], row['FlightNumber'],nn,row['From_To']]) 
                         for nn in row.RecentDelays], axis=1)

In [16]:
rows

[['KLM(!)', 10045.0, 23, 'LoNDon_paris'],
 ['KLM(!)', 10045.0, 47, 'LoNDon_paris'],
 ['(British Airways. )', 10065.0, 24, 'londON_StockhOlm'],
 ['(British Airways. )', 10065.0, 43, 'londON_StockhOlm'],
 ['(British Airways. )', 10065.0, 87, 'londON_StockhOlm'],
 ['12. Air France', 10075.0, 13, 'Budapest_PaRis'],
 ['"Swiss Air"', 10085.0, 67, 'Brussels_londOn'],
 ['"Swiss Air"', 10085.0, 32, 'Brussels_londOn']]

In [17]:
df.columns

Index(['FlightNumber', 'RecentDelays', 'Airline', 'From', 'To', 'From_To'], dtype='object')

In [18]:

df_new = pd.DataFrame(rows, columns=df_tmp.columns)

In [19]:
df_new

               From_To  FlightNumber  RecentDelays           Airline
0               KLM(!)       10045.0            23      LoNDon_paris
1               KLM(!)       10045.0            47      LoNDon_paris
2  (British Airways. )       10065.0            24  londON_StockhOlm
3  (British Airways. )       10065.0            43  londON_StockhOlm
4  (British Airways. )       10065.0            87  londON_StockhOlm
5       12. Air France       10075.0            13    Budapest_PaRis
6          "Swiss Air"       10085.0            67   Brussels_londOn
7          "Swiss Air"       10085.0            32   Brussels_londOn

5b. Expand the Series of lists into a DataFrame named delays, rename the columns delay_1,
delay_2, etc. and replace the unwanted RecentDelays column in df with delays.

In [20]:
df3 = pd.DataFrame(df.RecentDelays.values.tolist())
df3

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [21]:
col_lengths = df3.shape[1]
col_lengths

3

In [22]:
df3.columns[0]

0

In [23]:
col_list = []
col_dict = {}

for i in range(col_lengths):
    
    key = df3.columns[i]
    value = 'Delay'+ str(i+1)
    col_dict[key] = value

In [24]:
col_dict

{0: 'Delay1', 1: 'Delay2', 2: 'Delay3'}

In [25]:
df3.rename(columns=col_dict, inplace=True)

In [26]:
df3

   Delay1  Delay2  Delay3
0    23.0    47.0     NaN
1     NaN     NaN     NaN
2    24.0    43.0    87.0
3    13.0     NaN     NaN
4    67.0    32.0     NaN

In [27]:
df[["Delay1","Delay2","Delay3"]] = df3[["Delay1","Delay2","Delay3"]]

In [28]:
df

,FlightNumber,RecentDelays,Airline,From,To,From_To,Delay1,Delay2,Delay3
0,10045.0,"[23, 47]",KLM(!),London,Paris,LoNDon_paris,23.0,47.0,NaN
1,10055.0,[],<Air France> (12),Madrid,Milan,MAdrid_miLAN,NaN,NaN,NaN
2,10065.0,"[24, 43, 87]",(British Airways. ),London,Stockholm,londON_StockhOlm,24.0,43.0,87.0
3,10075.0,[13],12. Air France,Budapest,Paris,Budapest_PaRis,13.0,NaN,NaN
4,10085.0,"[67, 32]","""Swiss Air""",Brussels,London,Brussels_londOn,67.0,32.0,NaN